Table of Contents
 Class BentUpBar
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing bent-Up bar in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class BentUpBar : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
BentUpBar
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 BentUpBar()
Constructor
public BentUpBar()
Properties
 AddAnchor
Add anchor to bent up bar
public bool AddAnchor { get; set; }
Property Value
bool
 AnchorLength
Length of anchor for bent up bar
public double AnchorLength { get; set; }
Property Value
double
 Angle
Angle between bar and master edge
public double Angle { get; set; }
Property Value
double
 BottomLength
Length of additional bar on the bottom
public double BottomLength { get; set; }
Property Value
double
 IsOnLeft
Bar is on left or right side of member1D
public bool IsOnLeft { get; set; }
Property Value
bool
 MasterComponent
Master component of reinforcement
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 Offset
Offset of bent-Up bar from left/right edge
public double Offset { get; set; }
Property Value
double
 TopLength
Length of additional bar on the top
public double TopLength { get; set; }
Property Value
double
 Edit this page